rails_test_0/app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
  def index
    #Collects into instance var @cars for index.html.erb to use
    @cars = Car.all

INSERT INTO "cars" ("make", "model", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["make", "test"], ["model", "test1"], ["year", 1212], ["created_at", "2022-01-10 23:35:27.744238"], ["updated_at", "2022-01-10 23:35:27.744238"]]
---
  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_car
      @car = Car.find(params[:id])